from django.shortcuts import render
from django.http import HttpResponse, JsonResponse, FileResponse

from json import dumps as json_dumps, loads as json_loads
import uuid
from random import randbytes, uniform, randint, choice
import datetime
import json
from geopy.geocoders import Nominatim
from base64 import b64encode
import requests

from .models import Manager
from .models import Meeting
from math import sqrt, cos, radians, atan2, sin, tan

from .pathfinder import PathFinder

PATHS = []

data = [('Пантелеймон Фёдорович Третьяков', 'п. Москва, МГУ, пр. Сенной, д. 73, 756397'), ('Карпова Евфросиния Тимуровна', 'с. Москва, бул. Проточный, д. 3 к. 2/3, 429246'), ('Лонгин Всеволодович Матвеев', 'с. Москва, МГУ, ш. Карбышева, д. 957, 060013'), ('тов. Волков Адам Фокич', 'г. Москва, ш. Курчатова, д. 43, 374537'), ('Королева Лора Ждановна', 'к. Москва, ш. Полярное, д. 259 к. 2, 406556'), ('Шарова Раиса Николаевна', 'п. Москва, МГУ, алл. Подлесная, д. 34, 235036'), ('Игнатьев Ярополк Федосьевич', 'п. Москва, МГУ, пер. Короткий, д. 63 к. 45, 163392'), ('Роман Фокич Герасимов', 'г. Москва, пр. Тепличный, д. 5/3 к. 5/7, 062270'), ('Егорова Ангелина Николаевна', 'п. Москва, МГУ, пер. Тульский, д. 53 стр. 500, 973663'), ('Алла Алексеевна Боброва', 'г. Москва, алл. Механическая, д. 4 стр. 1/4, 199606'), ('Мария Анатольевна Мамонтова', 'д. Москва, МГУ, бул. Юности, д. 2/6 к. 402, 709534'), ('Евграф Бенедиктович Чернов', 'клх Москва, МГУ, наб. Автомобилистов, д. 961, 350148'), ('Носкова Василиса Мироновна', 'д. Москва, МГУ, ул. Новосельская, д. 8/7 к. 1/8, 710709'), ('Кулакова Иванна Михайловна', 'п. Москва, алл. Одесская, д. 828 к. 3/3, 443160'), ('Родионова Екатерина Валентиновна', 'клх Москва, ул. Ростовская, д. 54, 106375'), ('Алевтина Ефимовна Авдеева', 'ст. Москва, МГУ, пр. Пионерский, д. 77, 207323'), ('Куликов Всемил Брониславович', 'к. Москва, наб. Энергетическая, д. 8/8 к. 3/2, 737105'), ('Георгий Гурьевич Кононов', 'клх Москва, МГУ, пр. Одесский, д. 89 к. 205, 684995'), ('Марина Александровна Самсонова', 'ст. Москва, алл. Магистральная, д. 704 стр. 79, 848944'), ('Фёкла Антоновна Федотова', 'клх Москва, пр. Толбухина, д. 192 к. 359, 891040'), ('Алла Ильинична Никитина', 'г. Москва, ш. Ильича, д. 9 стр. 3/5, 069255'), ('Тихонова Лидия Кирилловна', 'с. Москва, МГУ, пер. Калужский, д. 7 стр. 298, 529456'), ('Киселев Болеслав Григорьевич', 'д. Москва, МГУ, пр. Бригадный, д. 5 к. 90, 205371'), ('Блинова Вероника Вениаминовна', 'с. Москва, МГУ, пр. Огородный, д. 326 стр. 913, 704592'), ('Константинов Евгений Вячеславович', 'с. Москва, пр. Нахимова, д. 142 стр. 981, 007557'), ('Гаврилова Евфросиния Сергеевна', 'с. Москва, МГУ, ул. Хвойная, д. 803 стр. 2/2, 868261'), ('Самуил Харитонович Хохлов', 'к. Москва, ш. 8 Марта, д. 5/8 к. 2, 477739'), ('Маргарита Эльдаровна Филиппова', 'п. Москва, МГУ, ш. Родниковое, д. 3 к. 2, 800148'), ('Колесникова Элеонора Эльдаровна', 'д. Москва, наб. Песчаная, д. 5 к. 476, 372305'), ('Виктория Вениаминовна Костина', 'клх Москва, алл. Менделеева, д. 5/1 стр. 1, 506718'), ('Анастасия Антоновна Лапина', 'д. Москва, алл. Октябрьская, д. 119, 889995'), ('Гордеев Аверкий Ефимьевич', 'ст. Москва, МГУ, ул. Мусы Джалиля, д. 8/4 стр. 21, 689281'), ('Тихон Артемьевич Наумов', 'с. Москва, наб. Дружбы, д. 37 стр. 13, 329827'), ('Власова Тамара Тимуровна', 'клх Москва, ш. Пушкина, д. 2, 162020'), ('Копылов Трофим Бенедиктович', 'к. Москва, МГУ, ш. Шевченко, д. 8/4, 152131'), ('Козлов Азарий Ефимович', 'клх Москва, ул. Стахановская, д. 321 стр. 95, 080969'), ('Филиппова Жанна Оскаровна', 'ст. Москва, наб. Логовая, д. 8/9, 357665'), ('Бурова Алла Даниловна', 'д. Москва, МГУ, алл. Покровская, д. 2 стр. 8/6, 970191'), ('Анна Эдуардовна Лукина', 'д. Москва, ул. Краснодарская, д. 896 стр. 85, 834115'), ('Селиверст Тихонович Дорофеев', 'с. Москва, пр. Кедровый, д. 5/7, 142211'), ('Гущин Ерофей Демьянович', 'к. Москва, МГУ, пер. Урожайный, д. 30, 546299'), ('Юлия Николаевна Новикова', 'г. Москва, ул. Каштановая, д. 22 стр. 4/3, 935957'), ('Гостомысл Евстигнеевич Кононов', 'п. Москва, алл. Хвойная, д. 45 стр. 1, 807630'), ('Блохин Лазарь Всеволодович', 'г. Москва, МГУ, ул. Школьная, д. 793 стр. 5/7, 673106'), ('Фотий Давидович Громов', 'д. Москва, пер. Шахтерский, д. 5, 230208'), ('Элеонора Артемовна Шестакова', 'г. Москва, МГУ, ш. Ленина, д. 65, 765719'), ('Лора Даниловна Артемьева', 'п. Москва, наб. Февральская, д. 379 к. 39, 573664'), ('Соловьев Корнил Бориславович', 'с. Москва, пер. Докучаева, д. 105 к. 24, 288442'), ('Блинова Регина Оскаровна', 'г. Москва, МГУ, пер. Курский, д. 1/3 стр. 5, 801128'), ('Лора Николаевна Щукина', 'п. Москва, алл. Водников, д. 1 стр. 6/6, 608476'), ('Исаев Творимир Федосеевич', 'г. Москва, пер. Трактовый, д. 310 стр. 33, 464403'), ('Турова Раиса Кузьминична', 'с. Москва, наб. Загородная, д. 4/6, 268238'), ('Селезнева Прасковья Георгиевна', 'ст. Москва, алл. Красногвардейская, д. 58 стр. 617, 800471'), ('Кононова Нина Максимовна', 'к. Москва, ул. Марта 8, д. 1 к. 6/6, 994338'), ('Арефий Фадеевич Голубев', 'ст. Москва, МГУ, пер. Машиностроителей, д. 7 к. 96, 707857'), ('тов. Филиппов Илья Герасимович', 'г. Москва, бул. Красный, д. 7/3 стр. 9, 128248'), ('Фирс Артемьевич Федоров', 'к. Москва, МГУ, наб. Нижняя, д. 3 стр. 3/6, 408194'), ('Лебедев Спартак Димитриевич', 'г. Москва, пер. Отрадный, д. 5/2, 885440'), ('Юдин Владимир Трифонович', 'с. Москва, МГУ, пер. Микрорайон, д. 4/6, 114427'), ('Терентий Денисович Мясников', 'клх Москва, пр. Линейный, д. 67, 353645'), ('Галактион Демьянович Осипов', 'клх Москва, наб. Гафури, д. 81, 036984'), ('Анжела Архиповна Афанасьева', 'с. Москва, пер. Краснопартизанский, д. 2, 743963'), ('Галина Степановна Гусева', 'г. Москва, МГУ, пер. Северный, д. 3, 820714'), ('Екатерина Мироновна Кабанова', 'ст. Москва, пр. Путейский, д. 9/1, 212501'), ('Сидорова Вера Рубеновна', 'к. Москва, алл. Л.Толстого, д. 937 стр. 6/2, 089210'), ('Ольга Святославовна Ермакова', 'д. Москва, МГУ, пер. Курганный, д. 814 к. 61, 896310'), ('Оксана Николаевна Кузьмина', 'п. Москва, МГУ, ул. Машиностроителей, д. 19 к. 87, 467437'), ('Кондратьев Севастьян Гордеевич', 'п. Москва, бул. Городской, д. 7 стр. 34, 655736'), ('Кабанова Зоя Анатольевна', 'к. Москва, бул. Толбухина, д. 9/4 к. 9/9, 334546'), ('Герасим Афанасьевич Силин', 'г. Москва, МГУ, алл. Березовая, д. 48 стр. 564, 775292'), ('Марфа Захаровна Кулакова', 'к. Москва, алл. Московская, д. 600 к. 417, 052122'), ('Анна Захаровна Фролова', 'д. Москва, наб. Гражданская, д. 8/5 к. 3, 937872'), ('Флорентин Федотович Селиверстов', 'д. Москва, бул. Мира, д. 36, 701409'), ('Иванна Натановна Лихачева', 'г. Москва, наб. Авиационная, д. 6, 562307'), ('Казакова Валентина Эльдаровна', 'д. Москва, бул. Астраханский, д. 4 к. 94, 898026'), ('Станимир Гертрудович Доронин', 'г. Москва, МГУ, пр. Революции, д. 9 стр. 299, 600915'), ('Павлов Андроник Арсенович', 'клх Москва, МГУ, бул. Просторный, д. 909 к. 954, 365208'), ('Анжелика Владимировна Никитина', 'ст. Москва, МГУ, ул. Ярославская, д. 74 к. 96, 560136'), ('Валентина Степановна Муравьева', 'с. Москва, МГУ, бул. Кузнечный, д. 79 к. 3, 894593'), ('Кулагина Олимпиада Рудольфовна', 'п. Москва, ш. Уральское, д. 762 к. 450, 504621'), ('Федоров Спартак Тарасович', 'ст. Москва, МГУ, ул. Береговая, д. 107, 406499'), ('Фёкла Святославовна Щербакова', 'к. Москва, ш. Крымское, д. 888 стр. 19, 673704'), ('Евпраксия Евгеньевна Гришина', 'д. Москва, алл. Совхозная, д. 40 к. 260, 886143'), ('Шарапов Орест Ильич', 'с. Москва, ул. Тургенева, д. 1/8, 782259'), ('Милен Филатович Большаков', 'г. Москва, бул. Харьковский, д. 3/6 к. 91, 846167'), ('Екатерина Сергеевна Тимофеева', 'п. Москва, бул. Дорожников, д. 9 к. 74, 617979'), ('Маргарита Матвеевна Иванова', 'клх Москва, МГУ, наб. 40 лет Победы, д. 7 к. 1, 121798'), ('Евпраксия Михайловна Никонова', 'ст. Москва, ул. Бригадная, д. 4, 438706'), ('Таисия Вадимовна Назарова', 'п. Москва, МГУ, наб. Олимпийская, д. 806, 418867'), ('Марина Максимовна Лебедева', 'п. Москва, бул. Чкалова, д. 2, 406557'), ('Колобова Вера Ждановна', 'к. Москва, МГУ, ул. Флотская, д. 2/9 к. 58, 579941'), ('Зайцев Гурий Гертрудович', 'п. Москва, МГУ, алл. Пограничная, д. 67 к. 4, 868314'), ('Исидор Алексеевич Буров', 'к. Москва, МГУ, ул. Шмидта, д. 2/2, 485049'), ('Остромир Жоресович Носов', 'к. Москва, алл. Камская, д. 4, 361194'), ('Казаков Ферапонт Тихонович', 'к. Москва, наб. Ольховая, д. 6 стр. 4, 923528'), ('Соловьев Карп Ефимьевич', 'ст. Москва, МГУ, ш. Космодемьянской, д. 65 к. 921, 891351'), ('Арефий Арсеньевич Кононов', 'ст. Москва, МГУ, бул. Гражданский, д. 9 стр. 27, 879597'), ('Радислав Витальевич Фролов', 'г. Москва, МГУ, бул. Таманский, д. 741, 968902'), ('Устинова Наталья Ильинична', 'клх Москва, ш. Совхозное, д. 3/4, 155890'), ('г-н Ермаков Ярослав Фадеевич', 'п. Москва, МГУ, бул. Учительский, д. 61 к. 85, 336001'), ('Лобанов Борислав Дорофеевич', 'с. Москва, ул. Главная, д. 13, 183070'), ('Алевтина Оскаровна Наумова', 'г. Москва, МГУ, наб. Дорожная, д. 6/5 к. 9, 810442'), ('Бирюкова Анжела Тарасовна', 'д. Москва, пр. Элеваторный, д. 66 стр. 2, 963003'), ('Вячеслав Харламович Ларионов', 'клх Москва, МГУ, алл. Урожайная, д. 7, 323606'), ('Лебедева Марина Робертовна', 'с. Москва, МГУ, наб. Воронежская, д. 29, 917806'), ('Кононов Тарас Чеславович', 'к. Москва, МГУ, ул. Просвещения, д. 42, 343436'), ('Макар Владиславович Большаков', 'ст. Москва, МГУ, алл. Инженерная, д. 8/9 стр. 491, 703694'), ('Афанасьев Никифор Геннадиевич', 'с. Москва, ул. Гончарова, д. 9/1, 385447'), ('Мясников Аггей Бенедиктович', 'г. Москва, МГУ, наб. Волжская, д. 456 к. 267, 958531'), ('Галина Матвеевна Лыткина', 'с. Москва, МГУ, ш. Геологов, д. 896 стр. 791, 351380'), ('Борислав Терентьевич Сергеев', 'г. Москва, МГУ, ш. Тенистое, д. 29 к. 2/1, 303953'), ('Бобылев Евстигней Данилович', 'д. Москва, МГУ, ш. Большевистское, д. 2/2, 294048'), ('Фомина Алевтина Валериевна', 'клх Москва, МГУ, алл. Большая, д. 6/8, 259923'), ('Дарья Никифоровна Нестерова', 'п. Москва, ш. Главное, д. 9/6, 440212'), ('Гришина Фаина Валентиновна', 'ст. Москва, МГУ, ш. Ильича, д. 2/8 стр. 175, 172115'), ('Шестаков Радован Ермолаевич', 'г. Москва, МГУ, ш. Санаторное, д. 4 к. 54, 813385'), ('Сергей Гертрудович Овчинников', 'д. Москва, наб. Кольцова, д. 71, 075735'), ('Самсонова Зоя Степановна', 'ст. Москва, МГУ, наб. Энергетическая, д. 565 стр. 58, 659733'), ('Мартынова Лукия Рудольфовна', 'д. Москва, алл. Шаумяна, д. 670, 646569'), ('Алевтина Станиславовна Самсонова', 'ст. Москва, ш. Медицинское, д. 2 к. 55, 725432'), ('Ювеналий Иларионович Бирюков', 'с. Москва, МГУ, ул. Нижняя, д. 39 к. 9/3, 104846'), ('г-жа Тарасова Нина Мироновна', 'к. Москва, ш. Колхозное, д. 5/4, 397233'), ('Савватий Богданович Горбунов', 'к. Москва, ш. Заозерное, д. 80 стр. 2/5, 412143'), ('Дорофеева Валерия Викторовна', 'г. Москва, МГУ, пер. Поперечный, д. 6/9, 210487'), ('Клавдия Валериевна Рожкова', 'ст. Москва, пр. Тополиный, д. 7/5, 892738'), ('Ростислав Герасимович Бобров', 'ст. Москва, МГУ, пр. Рябиновый, д. 152, 223875'), ('Дорофей Еремеевич Бобылев', 'д. Москва, МГУ, ш. Кочубея, д. 144, 886630'), ('Серафим Зиновьевич Филиппов', 'с. Москва, пр. Речной, д. 393 стр. 1, 074889'), ('Нестор Елисеевич Дмитриев', 'клх Москва, ул. Запрудная, д. 19 стр. 161, 484313'), ('Антонина Васильевна Сорокина', 'клх Москва, алл. Ленинская, д. 78 к. 558, 319369'), ('Комиссаров Тарас Богданович', 'г. Москва, МГУ, пер. Прохладный, д. 2/9 к. 11, 984845'), ('Марфа Эдуардовна Муравьева', 'клх Москва, МГУ, ш. З.Космодемьянской, д. 72 стр. 2/4, 982846'), ('Леонтий Терентьевич Афанасьев', 'г. Москва, пер. Родниковый, д. 9, 170773'), ('г-н Сазонов Ермолай Харлампович', 'клх Москва, ш. Монтажников, д. 786, 399551'), ('Гурьева Таисия Вениаминовна', 'д. Москва, ул. Новая, д. 6/4 стр. 4/3, 209294'), ('Милен Феодосьевич Логинов', 'ст. Москва, МГУ, пр. Морозова, д. 98 стр. 11, 947178'), ('Александров Феофан Захарьевич', 'д. Москва, МГУ, наб. Победа, д. 85, 977319'), ('Мокей Гавриилович Щукин', 'п. Москва, МГУ, алл. Широкая, д. 7/9, 881319'), ('Зыкова Анжела Тимофеевна', 'п. Москва, МГУ, ул. Коммунальная, д. 2 стр. 4/9, 607440'), ('Руслан Фролович Миронов', 'к. Москва, МГУ, ул. Целинная, д. 2/4 стр. 2, 376204'), ('Исидор Иосипович Владимиров', 'г. Москва, ул. Высокая, д. 5, 060551'), ('Данила Германович Третьяков', 'г. Москва, МГУ, бул. Котовского, д. 9/1 к. 4/4, 547053'), ('Родионов Поликарп Ефстафьевич', 'д. Москва, МГУ, наб. Мая 1, д. 18 к. 8, 692093'), ('Кондратьева Клавдия Артемовна', 'к. Москва, алл. Ключевая, д. 2 к. 952, 443836'), ('Меркушев Милен Федотович', 'к. Москва, ул. Молодежная, д. 509 стр. 164, 983206'), ('Горшков Авдей Дмитриевич', 'г. Москва, ул. Энергетическая, д. 8/8 стр. 32, 377651'), ('Елена Болеславовна Шарова', 'к. Москва, МГУ, пр. Степной, д. 5 к. 9/7, 595340'), ('Ширяев Корнил Иосифович', 'ст. Москва, МГУ, наб. Восьмого Марта, д. 9/8 к. 67, 371585'), ('Семенова Дарья Харитоновна', 'г. Москва, МГУ, ш. Боровое, д. 24 стр. 585, 614100'), ('Натан Ермилович Ковалев', 'с. Москва, ш. Сплавное, д. 6, 115409'), ('Вера Леонидовна Фадеева', 'ст. Москва, пр. Прудовой, д. 3 к. 2/4, 973033'), ('Наина Владиславовна Ефимова', 'к. Москва, МГУ, бул. Краснопартизанский, д. 55 стр. 683, 954405'), ('Котова Кира Михайловна', 'с. Москва, пер. Песочный, д. 668, 002745'), ('Октябрина Антоновна Петрова', 'к. Москва, МГУ, бул. Промышленный, д. 61 стр. 9/3, 407352'), ('Костина Ирина Аркадьевна', 'п. Москва, МГУ, алл. Карла Маркса, д. 221 к. 817, 894512'), ('Киселева Вероника Петровна', 'д. Москва, МГУ, пр. Совхозный, д. 486, 596673'), ('Полина Сергеевна Голубева', 'к. Москва, ш. Сибирское, д. 80 стр. 2/3, 927090'), ('Надежда Борисовна Гришина', 'г. Москва, алл. Чернышевского, д. 39, 907335'), ('Соломон Исидорович Никитин', 'д. Москва, ш. Павлика Морозова, д. 4 к. 420, 834022'), ('Мельников Валерьян Антипович', 'п. Москва, пер. Лазурный, д. 33 к. 761, 436157'), ('Артем Гурьевич Сысоев', 'клх Москва, МГУ, ул. Пархоменко, д. 2/5 стр. 9, 615380'), ('Федорова Анастасия Феликсовна', 'д. Москва, МГУ, бул. Придорожный, д. 1/6 стр. 75, 733572'), ('Елисеева Анжела Николаевна', 'п. Москва, МГУ, наб. Каштановая, д. 72, 188436'), ('Тарасов Измаил Елизарович', 'г. Москва, МГУ, бул. 9 мая, д. 952 стр. 904, 285245'), ('Иванов Степан Ермолаевич', 'д. Москва, пр. Володарского, д. 788 стр. 7, 578178'), ('Колесников Эраст Августович', 'клх Москва, бул. Заводской, д. 8 к. 92, 762206'), ('Колесников Герасим Викторович', 'д. Москва, пр. Луговой, д. 364, 837284'), ('Титов Любомир Валерьянович', 'к. Москва, наб. Советов, д. 891, 734714'), ('Галина Дмитриевна Петрова', 'клх Москва, пр. Отрадный, д. 64 стр. 5, 651375'), ('Калинин Антип Ефстафьевич', 'с. Москва, наб. Папанина, д. 9 к. 329, 025039'), ('Третьяков Феофан Анатольевич', 'к. Москва, МГУ, пр. Нижний, д. 9, 731465'), ('Алина Игоревна Красильникова', 'клх Москва, МГУ, алл. Прибрежная, д. 573 стр. 3/4, 623228'), ('Николаева Наина Феликсовна', 'д. Москва, ул. Новостройка, д. 17 к. 727, 999434'), ('Шестаков Чеслав Тарасович', 'п. Москва, пр. 50 лет Октября, д. 1/5 стр. 9/3, 831438'), ('Кузьмин Юрий Ааронович', 'с. Москва, пр. Локомотивный, д. 74 стр. 9/7, 372244'), ('Зиновьев Лазарь Якубович', 'с. Москва, бул. Разина, д. 47, 084733'), ('Анжелика Анатольевна Кудрявцева', 'к. Москва, ш. Победа, д. 6 к. 2/6, 261624'), ('Касьян Всеволодович Матвеев', 'ст. Москва, МГУ, ул. Заозерная, д. 902 стр. 69, 730898'), ('Мечислав Августович Федоров', 'к. Москва, алл. Дарвина, д. 44 стр. 5, 671860'), ('Виктория Владиславовна Меркушева', 'п. Москва, ул. Пожарского, д. 4 к. 685, 445026'), ('Зыков Мирослав Аксёнович', 'г. Москва, ш. Сурикова, д. 2/6 стр. 6, 843942'), ('Носов Константин Харлампович', 'д. Москва, пер. Новосельский, д. 3/1 к. 1/3, 174592'), ('Калинин Потап Александрович', 'к. Москва, пер. Тульский, д. 6/5, 051494'), ('Вадим Денисович Яковлев', 'д. Москва, МГУ, наб. Луначарского, д. 37 к. 2, 851801'), ('Моисей Владиленович Доронин', 'клх Москва, ш. Полевое, д. 593, 696421'), ('Никодим Артемьевич Громов', 'к. Москва, бул. Колхозный, д. 7/2 стр. 338, 645574'), ('Иларион Давыдович Копылов', 'к. Москва, МГУ, пер. Герцена, д. 523, 972398'), ('Самуил Иосипович Савельев', 'г. Москва, МГУ, пер. Бульварный, д. 52 к. 68, 767490'), ('Никанор Юлианович Андреев', 'г. Москва, алл. Декабристов, д. 71 стр. 543, 182835'), ('Лапин Наркис Изотович', 'клх Москва, МГУ, пер. Шолохова, д. 9/6, 669917'), ('Полякова Татьяна Наумовна', 'клх Москва, МГУ, пер. Рылеева, д. 77, 539565'), ('Федор Еремеевич Веселов', 'п. Москва, МГУ, алл. Ворошилова, д. 98 стр. 4, 824489'), ('Васильев Флорентин Елисеевич', 'клх Москва, МГУ, наб. Курганная, д. 7, 310023'), ('Журавлев Ферапонт Харлампьевич', 'с. Москва, ш. Совхозное, д. 34, 921244'), ('Василиса Константиновна Савина', 'к. Москва, МГУ, пер. 60 лет Октября, д. 938 к. 1, 886946'), ('Всемил Венедиктович Носов', 'ст. Москва, МГУ, наб. Станционная, д. 131 стр. 5, 512644'), ('Агафья Даниловна Титова', 'к. Москва, ул. Чайковского, д. 3 стр. 4/1, 984627'), ('Зинаида Мироновна Андреева', 'ст. Москва, МГУ, пер. Брянский, д. 255 к. 88, 780182'), ('Феврония Николаевна Кулагина', 'г. Москва, пр. Томский, д. 906 стр. 7/1, 522367'), ('Чернова Валерия Рудольфовна', 'клх Москва, алл. Водников, д. 430 стр. 7/1, 941477'), ('Марфа Ниловна Васильева', 'п. Москва, МГУ, ш. Кошевого, д. 8/1 к. 493, 776292'), ('Сысоева Мария Филипповна', 'д. Москва, ш. Свердлова, д. 2 к. 20, 419763'), ('Бобров Михей Аксёнович', 'к. Москва, пр. Трактовый, д. 6 к. 498, 938716'), ('Кулакова Фаина Макаровна', 'д. Москва, МГУ, алл. Подлесная, д. 49 к. 2/5, 418228'), ('Беляева Дарья Степановна', 'к. Москва, ш. Больничное, д. 44 стр. 38, 331320'), ('Блинов Викентий Юльевич', 'п. Москва, МГУ, пр. Республиканский, д. 4/9 стр. 828, 425254'), ('Савина Елизавета Андреевна', 'клх Москва, ул. М.Горького, д. 9, 641009'), ('Морозов Епифан Ильич', 'ст. Москва, МГУ, ш. Добролюбова, д. 18, 580053'), ('Никифоров Радим Тимурович', 'д. Москва, пер. Журавлева, д. 636 к. 931, 198811'), ('Дементьева Евпраксия Евгеньевна', 'с. Москва, МГУ, пр. Шевченко, д. 94 к. 1, 742612'), ('Алла Петровна Устинова', 'д. Москва, МГУ, наб. 9 мая, д. 343, 634261'), ('Доронин Милан Арсеньевич', 'ст. Москва, МГУ, ул. Глинки, д. 5, 916477'), ('Федотова Евфросиния Афанасьевна', 'с. Москва, ш. Береговое, д. 30 к. 9, 835170'), ('Раиса Васильевна Борисова', 'с. Москва, ш. Космонавтов, д. 67 к. 40, 218258'), ('Королев Милий Даниилович', 'д. Москва, МГУ, алл. Высоцкого, д. 1 стр. 553, 418134'), ('Андрон Герасимович Орехов', 'г. Москва, МГУ, бул. Дорожный, д. 4, 295294'), ('Харитонов Аскольд Феоктистович', 'д. Москва, МГУ, ш. Советское, д. 13, 250714'), ('Рогова Анна Федоровна', 'клх Москва, МГУ, пер. Крайний, д. 40 стр. 559, 898088'), ('Гусева Варвара Анатольевна', 'с. Москва, МГУ, бул. Попова, д. 242 стр. 4/8, 188641'), ('Марк Аверьянович Панов', 'г. Москва, МГУ, алл. Громова, д. 9, 407461'), ('Голубева Антонина Болеславовна', 'п. Москва, ул. Красногвардейская, д. 3 стр. 3, 870925'), ('Марк Владленович Аксенов', 'г. Москва, МГУ, наб. Суворова, д. 6/6, 864923'), ('Никитин Твердислав Власович', 'с. Москва, МГУ, бул. Максима Горького, д. 2 стр. 479, 031967'), ('Святослав Валентинович Коновалов', 'к. Москва, МГУ, ш. Сплавное, д. 186 к. 764, 634599'), ('Панов Никон Ермолаевич', 'клх Москва, бул. Красина, д. 1 стр. 2, 804740'), ('Киселева Тамара Васильевна', 'д. Москва, пр. Таежный, д. 5/2 к. 8, 025522'), ('Петрова Александра Владиславовна', 'с. Москва, бул. Шишкина, д. 7/7, 504583'), ('Яковлев Платон Тимурович', 'к. Москва, МГУ, бул. Логовой, д. 3/8, 618303'), ('Клавдия Степановна Дьячкова', 'к. Москва, алл. Родниковая, д. 895 к. 3, 662920'), ('Вероника Сергеевна Рожкова', 'ст. Москва, наб. Радужная, д. 3/4 стр. 3/9, 479103'), ('Мельникова София Павловна', 'с. Москва, МГУ, алл. Черемуховая, д. 9/8 стр. 96, 169360'), ('Гришин Ефим Эдгарович', 'п. Москва, пр. Театральный, д. 83 стр. 8, 040195'), ('Волков Флорентин Ефстафьевич', 'д. Москва, ш. Крупской, д. 36, 729200'), ('Пахомов Аристарх Исидорович', 'клх Москва, пер. Победа, д. 5 стр. 5/3, 011530'), ('Суворова Прасковья Михайловна', 'г. Москва, бул. 8-е Марта, д. 9 стр. 5/5, 690575'), ('Куликов Терентий Артемьевич', 'с. Москва, МГУ, пр. Плеханова, д. 7, 931575'), ('Морозов Адриан Устинович', 'к. Москва, алл. Пожарского, д. 85, 621995'), ('Парамон Всеволодович Селиверстов', 'п. Москва, МГУ, ул. Восточная, д. 4 стр. 6, 319648'), ('Лидия Семеновна Колесникова', 'клх Москва, МГУ, ул. Загородная, д. 2/2 стр. 7, 483198'), ('Евфросиния Степановна Горшкова', 'п. Москва, МГУ, пер. Советской Армии, д. 64 к. 6/5, 297071'), ('Анна Николаевна Шашкова', 'с. Москва, алл. Балтийская, д. 237 стр. 370, 478426'), ('Аксенова Юлия Робертовна', 'с. Москва, бул. Сахалинский, д. 2, 242469'), ('Федотов Мечислав Харлампьевич', 'ст. Москва, пер. З.Космодемьянской, д. 3/2 к. 633, 240976'), ('Эмилия Эльдаровна Николаева', 'с. Москва, пер. Малиновый, д. 435, 785713'), ('Алла Александровна Никонова', 'п. Москва, МГУ, ш. Ленское, д. 5/2, 774241'), ('Горшков Богдан Богданович', 'ст. Москва, пр. Харьковский, д. 14 стр. 1/1, 486312'), ('Алла Романовна Лаврентьева', 'к. Москва, МГУ, ул. Верхняя, д. 7 стр. 8/7, 678360'), ('Амвросий Изотович Харитонов', 'д. Москва, МГУ, ул. Полярная, д. 6, 038641'), ('Мокей Ермилович Суханов', 'клх Москва, МГУ, бул. Щетинкина, д. 51 стр. 444, 843987'), ('Горшков Кондрат Бориславович', 'к. Москва, МГУ, пр. Хуторской, д. 1/8 стр. 17, 237331'), ('Самуил Валерьевич Медведев', 'г. Москва, МГУ, бул. Каштановый, д. 7/1 стр. 5, 194007'), ('Шаров Спартак Захарьевич', 'с. Москва, МГУ, пер. Степной, д. 5/3, 665145'), ('Евфросиния Матвеевна Белоусова', 'с. Москва, бул. Веселый, д. 4/7, 809067'), ('Антонина Анатольевна Богданова', 'к. Москва, ш. Р.Люксембург, д. 61 стр. 4, 500674'), ('Соловьев Милен Адамович', 'ст. Москва, МГУ, бул. Котовского, д. 7 стр. 1/5, 812396'), ('Гаврилова Василиса Матвеевна', 'д. Москва, МГУ, алл. Чайковского, д. 47 к. 22, 195833'), ('Иннокентий Матвеевич Никитин', 'с. Москва, МГУ, наб. Воронежская, д. 933 стр. 5, 955730'), ('Потапова Жанна Станиславовна', 'д. Москва, МГУ, пер. Карбышева, д. 64 стр. 713, 658092'), ('Исакова Милица Захаровна', 'п. Москва, МГУ, бул. Кирпичный, д. 181 к. 6/7, 692856'), ('Сафонов Тит Августович', 'ст. Москва, МГУ, ш. Красное, д. 56 к. 1/7, 938709'), ('Ульян Дорофеевич Ситников', 'ст. Москва, МГУ, наб. Березовая, д. 2/1, 067694'), ('Ладислав Герасимович Панов', 'клх Москва, МГУ, алл. Энтузиастов, д. 9/1 к. 6/7, 966944'), ('Пестов Селиверст Геннадиевич', 'с. Москва, МГУ, ш. Депутатское, д. 1 к. 662, 620278'), ('Нинель Харитоновна Соболева', 'к. Москва, МГУ, ш. Зои Космодемьянской, д. 5 стр. 497, 870828'), ('Фомичев Ювеналий Изотович', 'д. Москва, наб. Черемушки, д. 9/4, 672961'), ('Ия Оскаровна Гусева', 'ст. Москва, МГУ, алл. Марта 8, д. 118, 119320'), ('Лыткин Флорентин Юлианович', 'ст. Москва, МГУ, алл. Ярославская, д. 3/7, 322437'), ('Быков Марк Евсеевич', 'с. Москва, МГУ, бул. Нижний, д. 760 стр. 8/7, 131840'), ('Анжела Тарасовна Костина', 'ст. Москва, МГУ, наб. Комарова, д. 20, 928920'), ('Морозов Ульян Гертрудович', 'к. Москва, МГУ, алл. Трудовая, д. 5 к. 348, 636631'), ('Владимир Фадеевич Калинин', 'п. Москва, МГУ, ул. Логовая, д. 77 к. 9/7, 139642'), ('Никитина Зоя Юльевна', 'г. Москва, МГУ, бул. Уральский, д. 82, 779746'), ('Светлана Тимуровна Ефимова', 'с. Москва, МГУ, ул. Сенная, д. 25 к. 94, 683764'), ('Елисеева Маргарита Леоновна', 'д. Москва, ш. Центральное, д. 466, 694718'), ('Большакова Иванна Захаровна', 'п. Москва, МГУ, бул. Пушкинский, д. 839 стр. 7, 660475'), ('Наина Андреевна Гущина', 'ст. Москва, пр. 50 лет Октября, д. 9/5, 220930'), ('Мирослав Тихонович Ильин', 'ст. Москва, ул. Верхняя, д. 3/2 стр. 3, 597780'), ('Иванна Захаровна Пахомова', 'д. Москва, МГУ, пер. Просвещения, д. 15, 655399'), ('Агата Артемовна Субботина', 'ст. Москва, ш. Крылова, д. 6/7 стр. 371, 329972'), ('Семенова Елена Владимировна', 'д. Москва, ул. Целинная, д. 792 к. 6, 893098'), ('Мирон Ефимьевич Суханов', 'д. Москва, МГУ, ш. Мичурина, д. 7, 273457'), ('Власова Дарья Васильевна', 'п. Москва, МГУ, ул. Микрорайон, д. 5 стр. 3, 983802'), ('Фомин Владилен Августович', 'п. Москва, наб. Комсомольская, д. 2/9, 302605'), ('Маргарита Геннадьевна Игнатьева', 'ст. Москва, МГУ, бул. Привольный, д. 1/7, 053326'), ('Рюрик Германович Жуков', 'клх Москва, МГУ, алл. Волкова, д. 5/2 к. 1, 711824'), ('Алина Аркадьевна Селиверстова', 'с. Москва, МГУ, ул. Космонавтов, д. 450 к. 1, 655516'), ('Максимов Авдей Богданович', 'клх Москва, пер. Волочаевский, д. 808 к. 4/5, 332437'), ('г-н Потапов Дементий Эдгарович', 'г. Москва, МГУ, ш. Большевистское, д. 8/4 стр. 232, 670285'), ('Тихонов Варфоломей Анисимович', 'ст. Москва, МГУ, бул. Депутатский, д. 911, 408954'), ('Мечислав Даниилович Комаров', 'п. Москва, МГУ, бул. 8 Марта, д. 38 к. 9, 464463'), ('Ульяна Анатольевна Гаврилова', 'к. Москва, МГУ, пр. Бажова, д. 8/5 к. 2/6, 241358'), ('Таисия Эльдаровна Морозова', 'клх Москва, ул. Жуковского, д. 2/7 стр. 5/7, 322173'), ('Виноградова Василиса Рубеновна', 'г. Москва, МГУ, пер. Тракторный, д. 51, 308001'), ('Русакова Мария Егоровна', 'г. Москва, наб. Лунная, д. 43 стр. 213, 156911'), ('Антип Германович Панфилов', 'п. Москва, алл. Докучаева, д. 8 к. 79, 076891'), ('Валерьян Харитонович Савельев', 'с. Москва, пер. Мусы Джалиля, д. 3 к. 445, 655825'), ('Кулагина Ксения Тарасовна', 'ст. Москва, МГУ, пер. Привольный, д. 7 к. 8/2, 428853'), ('Афанасьев Якуб Ааронович', 'клх Москва, МГУ, наб. Угольная, д. 370, 722051'), ('Носова Нонна Евгеньевна', 'г. Москва, наб. Прохладная, д. 8/3 к. 15, 292173'), ('Лидия Антоновна Коновалова', 'ст. Москва, наб. Заводская, д. 847 к. 9, 854118')]

def rnd():
	return randint(0, 9)

def generate_phone():
	phone = '89'
	for i in range(9):
		phone += str(rnd())

	return phone

def dist(p1, p2):
	R = 6371
	lon1, lat1 = p1
	lon2, lat2 = p2
	phi_1 = radians(lat1)
	phi_2 = radians(lat2)
	delta_lat = radians(lat2 - lat1)
	delta_lon = radians(lon2 - lon1)
	a = sin(delta_lat / 2.0) * sin(delta_lat / 2.0) + cos(phi_1) * cos(phi_2) * sin(delta_lon / 2.0) * sin(delta_lon / 2.0)
	c = 2 * atan2(sqrt(a), sqrt(1 - a))
	d = c * R
	return d

def get_path_length(path):
	l = 0
	meetings = Meeting.objects.all()
	for i in range(len(path) - 1):
		l += dist([meetings[path[i]].longitude, meetings[path[i]].latitude], [meetings[path[i + 1]].longitude, meetings[path[i + 1]].latitude])

	return l

geolocator = Nominatim(user_agent="tochka")

def get_json(request):
	try:
		json = json_loads(request.body)
		if type(json) == dict:
			return json
		return None
	except Exception as e:
		print(f'ERROR: {e}')
		return None

def generate_token():
	return str(uuid.uuid4())

def get_error(string):
	return {'status':'error', 'error':string}

def locate(address):
	location = geolocator.geocode(address)
	if location == None:
		return None
	print(f'Request address: {address}, found: {location.address}')
	return location.longitude, location.latitude

def index(request):
	return HttpResponse('OK')

def add_manager(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'name' not in json:
		return JsonResponse(get_error('Field "name" not found'))
	if 'surname' not in json:
		return JsonResponse(get_error('Field "surname" not found'))
	if 'phone' not in json:
		return JsonResponse(get_error('Field "phone" not found'))

	manager_token = generate_token()

	manager = Manager.objects.create(name=json['name'], surname=json['surname'], phone=json['phone'], token=manager_token)

	manager.save()

	return JsonResponse({'status':'ok'})

def create_meeting(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'name' not in json:
		return JsonResponse(get_error('Field "name" not found'))
	if 'surname' not in json:
		return JsonResponse(get_error('Field "surname" not found'))
	if 'time' not in json:
		return JsonResponse(get_error('Field "time" not found'))
	if 'address' not in json:
		return JsonResponse(get_error('Field "address" not found'))
	if 'phone' not in json:
		return JsonResponse(get_error('Field "phone" not found'))

	if not json['time'].isdecimal():
		return JsonResponse(get_error(f'Field "time" is invalid: {json["time"]}'))
	time = datetime.datetime.fromtimestamp(int(json['time']))

	token = b64encode(randbytes(32)).decode().replace('/', '+').replace('-', '_')

	location = locate(json['address'])

	if location == None:
		return JsonResponse(get_error(f'Field "address" is invalid:{json["address"]}'))

	longitude, latitude = location

	phone = json['phone']

	manager = Manager.objects.all()[0]

	meeting = Meeting.objects.create(name=json['name'], surname=json['surname'], address=json['address'], longitude=longitude, latitude=latitude, time=time, token=token, phone=phone)
	meeting.save()

	return JsonResponse({'status':'ok'})

def get_manager_meetings(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'token' not in json:
		return JsonResponse(get_error('Field "token" not found'))

	token = json['token']

	if not manager:
		return JsonResponse(get_error('Manager not found'))
	
	meetings = Meeting.objects.filter(manager_token=token)

	meetings_json = []

	for i in meetings:
		meetings_json.append({'name':i.name, 'surname':i.surname, 'time':int(i.time.timestamp())})

	return JsonResponse({'meetings':meetings_json})

def get_managers(request):
	if  request.method != 'GET':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	managers = Manager.objects.all()
	managers_json = []
	for i in managers[:5]:
		managers_json.append({'name':i.name, 'surname':i.surname, 'phone':i.phone, 'token':i.token})

	return JsonResponse({'managers':managers_json})

def bind_meeting_to_manager(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'meeting_id' not in json:
		return JsonResponse(get_error('Field "meeting_id" not found'))
	if 'token' not in json:
		return JsonResponse(get_error('Field "token" not found'))

	meeting = Meeting.objects.get(token=json['meeting_id'])
	manager = Manager.objects.get(token=json['token'])

	if manager is None:
		return JsonResponse(get_error('Invalid token'))

	meeting.manager_token = token
	meeting.save()

	return JsonResponse({'status':'ok'})

def get_meeting(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'meeting_id' not in json:
		return JsonResponse(get_error('Field "meeting_id" not found'))

	meeting = Meeting.objects.get(token=json['meeting_id'])

	return JsonResponse({'name':meeting.name, 'surname':meeting.surname, 'time':meeting.time.timestamp()})

def get_path(request):
	global PATHS

	if PATHS != []:
		meetings = Meeting.objects.all()
		paths = []
		lengths = []
		tokens = []

		for i in range(len(meetings)):
			if meetings[i].manager_token in tokens:
				paths[tokens.index(meetings[i].manager_token)].append(i)
			else:
				paths.append([i,])
				tokens.append(meetings[i].manager_token)
				lengths.append(0)

		for i in range(len(paths)):
			a = []
			for j in range(len(paths[i])):
				a.append([meetings[paths[i][j]].time, paths[i][j]])
			a = sorted(a)
			for j in range(len(a)):
				paths[i][j] = a[j][1]

		for i in range(len(paths)):
			lengths[i] = dist((37.647971, 55.745463), (meetings[paths[i][0]].longitude, meetings[paths[i][0]].latitude))
			for j in range(1, len(paths[i])):
				lengths[i] += dist((meetings[paths[i][j - 1]].longitude, meetings[paths[i][j - 1]].latitude), (meetings[paths[i][j]].longitude, meetings[paths[i][j]].latitude))

		for i in range(len(tokens)):
			manager = Manager.objects.get(token=tokens[i])
			manager.distance += lengths[i]
			manager.meeting_count += len(paths[i])
			manager.save()

	meetings = []

	today = datetime.datetime.today()

	for i in Meeting.objects.all():
		if i.time.day == today.day and i.time.month == today.month and i.time.year == today.year:
			meetings.append({'name':i.name, 'surname':i.surname, 'time':i.time, 'longitude':i.longitude, 'latitude':i.latitude})

	points = []

	times = []

	meetings_indices = []

	for j in range(len(meetings)):
		i = meetings[j]
		points.append([i['longitude'], i['latitude'], 0])
		times.append(i['time'])
		meetings_indices.append(j)

	graph = {}

	for i in range(len(points)):
		graph[i] = []
		for j in range(len(points)):
			if i != j:
				d = dist(points[i][:2], points[j][:2])
				if d < 0:
					print(f'Zhopa, d={d} v puti mezhdu {i}, {j}')
				h = int(times[i].hour + 1 + d // 25)
				m = int(times[i].minute + ((d / 25.0) % 1) * 60)
				if h * 60 + m < times[j].hour * 60 + times[j].minute - 20:
					graph[i].append([j, d])

	pathfinder = PathFinder(graph, len(points))
	PATHS = pathfinder.find_all_paths()

	managers = Manager.objects.filter(status=True)
	meetings = Meeting.objects.all()

	if len(PATHS) > len(managers):
		return JsonResponse(get_error(f'Not enough active managers, need {len(PATHS) - len(managers)} more'))

	for i in range(len(PATHS)):
		for j in PATHS[i]:
			meeting = meetings[meetings_indices[j]]
			setattr(meeting, 'manager_token', managers[i].token)
			meeting.save()

	return JsonResponse({'status':'ok', 'paths':str(PATHS)})

def delete_manager(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'token' not in json:
		return JsonResponse(get_error('Field "token" not found'))

	manager = Manager.objects.get(token=json['token'])

	if manager == None:
		return JsonResponse(get_error('Token is invalid'))

	manager.delete()

	return JsonResponse({'status':'ok'})

def authorize(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'name' not in json:
		return JsonResponse(get_error('Field "name" not found'))
	if 'surname' not in json:
		return JsonResponse(get_error('Field "surname" not found'))

	manager = Manager.objects.get(name=json['name'], surname=json['surname'])

	if manager == None:
		return JsonResponse(get_error('Manager not found'))

	return JsonResponse({'token':manager.token})

def get_meetings_for_day(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'token' not in json:
		return JsonResponse(get_error('Field "token" not found'))
	if 'time' not in json:
		return JsonResponse(get_error('Field "time" not found'))

	token = json['token']

	meetings = Meeting.objects.filter(manager_token=token).order_by('time')
	if len(meetings) == 0:
		return JsonResponse(get_error('Invalid token'))
	day = datetime.datetime.fromtimestamp(json['time']).date()

	meetings_day = []

	for i in meetings:
		if i.time.date() == day:
			time = str(i.time.hour).zfill(2) + ':' + str(i.time.minute).zfill(2)
			meetings_day.append({'name':i.name, 'surname':i.surname, 'address':i.address, 'longitude':i.longitude, 'latitude':i.latitude, 'time':time, 'phone':i.phone})

	return JsonResponse({'meetings':meetings_day})

def get_weather(request):
	try:
		answer = requests.get('http://api.openweathermap.org/data/2.5/weather?q=Moscow&appid=78a7ce3de999f6adb0474ff0a38f2fb5').text
	except:
		return JsonResponse(get_error('Service is unavailable'))
	
	answer = json_loads(answer)

	answer = {'id':answer['weather'][0]['id'], 'temp':answer['main']['temp'] - 273.15}

	return JsonResponse(answer)

def get_all_meetings(request):
	managers = list(Manager.objects.all())

	meetings = Meeting.objects.all()
	meetings_list = {}
	for i in meetings:
		if i.manager_token != '':
			index = 0
			for j in range(len(managers)):
				if i.manager_token == managers[j].token:
					index = j
					break
			if index in meetings_list:
				meetings_list[index].append({'longitude':i.longitude, 'latitude':i.latitude})
			else:
				meetings_list[index] = [{'longitude':i.longitude, 'latitude':i.latitude},]

	return JsonResponse({'meetings':meetings_list})

def generate_meetings(request):
	for i in range(40):
		start = (55.745463, 37.647971)
		longitude, latitude = start[0] + uniform(-0.1, 0.1), start[1] + uniform(-0.1, 0.1)
		data_i = data[i]
		a = data_i[0].split(' ')
		if len(a) == 4:
			name, surname = a[1], a[3]
		else:
			name, surname = a[0], a[2]
		meeting = Meeting.objects.create(name=name, surname=surname, token=str(uniform(0, 1)), time=datetime.datetime(2021, 11, 5, randint(9, 16), randint(0, 59)), longitude=longitude, latitude=latitude, address=data_i[1], phone=generate_phone())
		meeting.save()

	return JsonResponse({'status':'ok'})

def set_manager_status(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'token' not in json:
		return JsonResponse(get_error('Field "token" not found'))
	if 'status' not in json:
		return JsonResponse(get_error('Field "status" not found'))

	manager = Manager.objects.get(token=json['token'])

	if manager is None:
		return JsonResponse(get_error('Invalid token'))

	status = str(json['status'])

	if status == '1':
		manager.status = True
		manager.save()
	elif status == '0':
		manager.status = False
		manager.save()
	else:
		return JsonResponse(get_error('Invalid status'))

	return JsonResponse({'status':'ok'})

def get_manager_status(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'token' not in json:
		return JsonResponse(get_error('Field "token" not found'))
	if 'status' not in json:
		return JsonResponse(get_error('Field "status" not found'))

	manager = Manager.objects.get(token=json['token'])

	if manager is None:
		return JsonResponse(get_error('Invalid token'))

	status = str(int(manager.status))

	return JsonResponse({'status':status})

def set_meetings_to_today(request):
	meetings = Meeting.objects.all()

	for i in meetings:
		new_time = i.time
		today = datetime.datetime.today()
		new_time = datetime.datetime(today.year, today.month, today.day, new_time.hour, new_time.minute)
		i.time = new_time
		i.save()

	return JsonResponse({'status':'ok'})

def randomize_paths(request):
	max_count = 50
	meetings = Meeting.objects.all()
	for i in range(max_count):
		meeting_1 = choice(meetings)
		meeting_2 = choice(meetings)
		manager_1 = meeting_1.manager_token
		manager_2 = meeting_2.manager_token
		meeting_1.manager_token = manager_2
		meeting_2.manager_token = manager_1
		meeting_1.save()
		meeting_2.save()

	return JsonResponse({'status':'ok'})

def get_all_paths_length(request):
	length = 0
	meetings = Meeting.objects.all()
	paths = []
	tokens = []

	for i in range(len(meetings)):
		if meetings[i].manager_token in tokens:
			paths[tokens.index(meetings[i].manager_token)].append(i)
		else:
			paths.append([i,])
			tokens.append(meetings[i].manager_token)

	for i in range(len(paths)):
		a = []
		for j in range(len(paths[i])):
			a.append([meetings[paths[i][j]].time, paths[i][j]])
		a = sorted(a)
		for j in range(len(a)):
			paths[i][j] = a[j][1]

	for i in paths:
		length += dist((37.647971, 55.745463), (meetings[i[0]].longitude, meetings[i[0]].latitude))
		for j in range(1, len(i)):
			length += dist((meetings[i[j - 1]].longitude, meetings[i[j - 1]].latitude), (meetings[i[j]].longitude, meetings[i[j]].latitude))

	return JsonResponse({'length':length})

def get_manager_meetings_count(request):
	if request.method != 'POST':
		return JsonResponse(get_error(f'Wrong method: {request.method}'))

	json = get_json(request)
	if json is None:
		return JsonResponse(get_error('Invalid JSON'))

	if 'token' not in json:
		return JsonResponse(get_error('Field "token" not found'))

	manager = Manager.objects.get(token=json['token'])

	return JsonResponse({'count':manager.meeting_count, 'path':manager.distance})

def get_meetings_of(request):
	managers = Manager.objects.all()
	counts = {}

	for i in managers:
		meetings = Meeting.objects.filter(manager_token=i.token)
		counts[i.token] = [len(meetings), i.name, i.surname]

	return JsonResponse({'count':counts})